stevenj/avr-libc3/include/avr/io/attiny861a.h
/* COM1B1 Shadow Bit */
typedef enum TC1_COM1B1S_enum
{
    TC1_COM1B1S_CLEAR_gc = (0x00), /* COM1B1 Shadow Bit - CLEAR */
    TC1_COM1B1S_SET_gc   = (0x20), /* COM1B1 Shadow Bit - SET */
} TC1_COM1B1S_t;

/* COM1B0 Shadow Bit */
typedef enum TC1_COM1B0S_enum
{
    TC1_COM1B0S_CLEAR_gc = (0x00), /* COM1B0 Shadow Bit - CLEAR */
    TC1_COM1B0S_SET_gc   = (0x10), /* COM1B0 Shadow Bit - SET */
} TC1_COM1B0S_t;

/* Comparator D output mode */
#define TC1_TCCR1C_COM1D_gc(x) ((x<<2) & 0x0C)

/* Force Output Compare Match 1D */
typedef enum TC1_FOC1D_enum
{
    TC1_FOC1D_CLEAR_gc = (0x00), /* Force Output Compare Match 1D - CLEAR */
    TC1_FOC1D_SET_gc   = (0x02), /* Force Output Compare Match 1D - SET */
} TC1_FOC1D_t;

/* Pulse Width Modulator D Enable */
typedef enum TC1_PWM1D_enum
{
    TC1_PWM1D_CLEAR_gc = (0x00), /* Pulse Width Modulator D Enable - CLEAR */
    TC1_PWM1D_SET_gc   = (0x01), /* Pulse Width Modulator D Enable - SET */
} TC1_PWM1D_t;

/* Fault Protection Interrupt Enable */
typedef enum TC1_FPIE1_enum
{
    TC1_FPIE1_CLEAR_gc = (0x00), /* Fault Protection Interrupt Enable - CLEAR */
    TC1_FPIE1_SET_gc   = (0x80), /* Fault Protection Interrupt Enable - SET */
} TC1_FPIE1_t;

/* Fault Protection Mode Enable */
typedef enum TC1_FPEN1_enum
{
    TC1_FPEN1_CLEAR_gc = (0x00), /* Fault Protection Mode Enable - CLEAR */
    TC1_FPEN1_SET_gc   = (0x40), /* Fault Protection Mode Enable - SET */
} TC1_FPEN1_t;

/* Fault Protection Noise Canceler */
typedef enum TC1_FPNC1_enum
{
    TC1_FPNC1_CLEAR_gc = (0x00), /* Fault Protection Noise Canceler - CLEAR */
    TC1_FPNC1_SET_gc   = (0x20), /* Fault Protection Noise Canceler - SET */
} TC1_FPNC1_t;

/* Fault Protection Edge Select */
typedef enum TC1_FPES1_enum
{
    TC1_FPES1_CLEAR_gc = (0x00), /* Fault Protection Edge Select - CLEAR */
    TC1_FPES1_SET_gc   = (0x10), /* Fault Protection Edge Select - SET */
} TC1_FPES1_t;

/* Fault Protection Analog Comparator Enable */
typedef enum TC1_FPAC1_enum
{
    TC1_FPAC1_CLEAR_gc = (0x00), /* Fault Protection Analog Comparator Enable - CLEAR */
    TC1_FPAC1_SET_gc   = (0x08), /* Fault Protection Analog Comparator Enable - SET */
} TC1_FPAC1_t;

/* Fault Protection Interrupt Flag */
typedef enum TC1_FPF1_enum
{
    TC1_FPF1_CLEAR_gc = (0x00), /* Fault Protection Interrupt Flag - CLEAR */
    TC1_FPF1_SET_gc   = (0x04), /* Fault Protection Interrupt Flag - SET */
} TC1_FPF1_t;

/* Waveform Generation Mode Bit */
typedef enum TC1_WGM1_enum
{
    TC1_WGM1_VAL_0x00_gc = (0x00), /* Fast PWM (NB! PWMx must be set!) */
    TC1_WGM1_VAL_0x01_gc = (0x01), /* Phase and Frequency Correct PWM */
    TC1_WGM1_VAL_0x02_gc = (0x02), /* PWM6/Single-slope */
    TC1_WGM1_VAL_0x03_gc = (0x03), /* PWM6/Dual-slope */
} TC1_WGM1_t;

/* OCIE1D: Timer/Counter1 Output Compare Interrupt Enable */
typedef enum TC1_OCIE1D_enum
{
    TC1_OCIE1D_CLEAR_gc = (0x00), /* OCIE1D: Timer/Counter1 Output Compare Interrupt Enable - CLEAR */
    TC1_OCIE1D_SET_gc   = (0x80), /* OCIE1D: Timer/Counter1 Output Compare Interrupt Enable - SET */
} TC1_OCIE1D_t;

/* OCIE1A: Timer/Counter1 Output Compare Interrupt Enable */
typedef enum TC1_OCIE1A_enum
{
    TC1_OCIE1A_CLEAR_gc = (0x00), /* OCIE1A: Timer/Counter1 Output Compare Interrupt Enable - CLEAR */
    TC1_OCIE1A_SET_gc   = (0x40), /* OCIE1A: Timer/Counter1 Output Compare Interrupt Enable - SET */
} TC1_OCIE1A_t;

/* OCIE1A: Timer/Counter1 Output Compare B Interrupt Enable */
typedef enum TC1_OCIE1B_enum
{
    TC1_OCIE1B_CLEAR_gc = (0x00), /* OCIE1A: Timer/Counter1 Output Compare B Interrupt Enable - CLEAR */
    TC1_OCIE1B_SET_gc   = (0x20), /* OCIE1A: Timer/Counter1 Output Compare B Interrupt Enable - SET */
} TC1_OCIE1B_t;

/* Timer/Counter1 Overflow Interrupt Enable */
typedef enum TC1_TOIE1_enum
{
    TC1_TOIE1_CLEAR_gc = (0x00), /* Timer/Counter1 Overflow Interrupt Enable - CLEAR */
    TC1_TOIE1_SET_gc   = (0x04), /* Timer/Counter1 Overflow Interrupt Enable - SET */
} TC1_TOIE1_t;

/* Timer/Counter1 Output Compare Flag 1D */
typedef enum TC1_OCF1D_enum
{
    TC1_OCF1D_CLEAR_gc = (0x00), /* Timer/Counter1 Output Compare Flag 1D - CLEAR */
    TC1_OCF1D_SET_gc   = (0x80), /* Timer/Counter1 Output Compare Flag 1D - SET */
} TC1_OCF1D_t;

/* Timer/Counter1 Output Compare Flag 1A */
typedef enum TC1_OCF1A_enum
{
    TC1_OCF1A_CLEAR_gc = (0x00), /* Timer/Counter1 Output Compare Flag 1A - CLEAR */
    TC1_OCF1A_SET_gc   = (0x40), /* Timer/Counter1 Output Compare Flag 1A - SET */
} TC1_OCF1A_t;

/* Timer/Counter1 Output Compare Flag 1B */
typedef enum TC1_OCF1B_enum
{
    TC1_OCF1B_CLEAR_gc = (0x00), /* Timer/Counter1 Output Compare Flag 1B - CLEAR */
    TC1_OCF1B_SET_gc   = (0x20), /* Timer/Counter1 Output Compare Flag 1B - SET */
} TC1_OCF1B_t;

/* Timer/Counter1 Overflow Flag */
typedef enum TC1_TOV1_enum
{
    TC1_TOV1_CLEAR_gc = (0x00), /* Timer/Counter1 Overflow Flag - CLEAR */
    TC1_TOV1_SET_gc   = (0x04), /* Timer/Counter1 Overflow Flag - SET */
} TC1_TOV1_t;

/* Timer/Counter 1 Dead Time Value-DT1H */
#define TC1_DT1_DT1H_gc(x) ((x<<4) & 0xF0)

/* Timer/Counter 1 Dead Time Value-DT1L */
#define TC1_DT1_DT1L_gc(x) (x & 0x0F)

/*
--------------------------------------------------------------------------------
BOOT_LOAD - Bootloader
--------------------------------------------------------------------------------
*/

typedef struct BOOT_LOAD_struct
{
    register8_t rsv_0x00[87]; /* RESERVED REGISTER BLOCK */
    register8_t SPMCSR;       /* Store Program Memory Control Register */
} BOOT_LOAD_t;


/* Clear temporary page buffer */
typedef enum BOOT_LOAD_CTPB_enum
{
    BOOT_LOAD_CTPB_CLEAR_gc = (0x00), /* Clear temporary page buffer - CLEAR */
    BOOT_LOAD_CTPB_SET_gc   = (0x10), /* Clear temporary page buffer - SET */
} BOOT_LOAD_CTPB_t;

/* Read fuse and lock bits */
typedef enum BOOT_LOAD_RFLB_enum
{
    BOOT_LOAD_RFLB_CLEAR_gc = (0x00), /* Read fuse and lock bits - CLEAR */
    BOOT_LOAD_RFLB_SET_gc   = (0x08), /* Read fuse and lock bits - SET */
} BOOT_LOAD_RFLB_t;

